rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MSCM.h
#define MSCM_IRCPCFG_CP1_TR_MASK                 (0x2U)
#define MSCM_IRCPCFG_CP1_TR_SHIFT                (1U)
#define MSCM_IRCPCFG_CP1_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP1_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP1_TR_SHIFT)) & MSCM_IRCPCFG_CP1_TR_MASK)

#define MSCM_IRCPCFG_CP2_TR_MASK                 (0x4U)
#define MSCM_IRCPCFG_CP2_TR_SHIFT                (2U)
#define MSCM_IRCPCFG_CP2_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP2_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP2_TR_SHIFT)) & MSCM_IRCPCFG_CP2_TR_MASK)

#define MSCM_IRCPCFG_CP3_TR_MASK                 (0x8U)
#define MSCM_IRCPCFG_CP3_TR_SHIFT                (3U)
#define MSCM_IRCPCFG_CP3_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP3_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP3_TR_SHIFT)) & MSCM_IRCPCFG_CP3_TR_MASK)

#define MSCM_IRCPCFG_LOCK_MASK                   (0x80000000U)
#define MSCM_IRCPCFG_LOCK_SHIFT                  (31U)
#define MSCM_IRCPCFG_LOCK_WIDTH                  (1U)
#define MSCM_IRCPCFG_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_LOCK_SHIFT)) & MSCM_IRCPCFG_LOCK_MASK)
/*! @} */

/*! @name XN_CTRL - Memory Execution Control */
/*! @{ */

#define MSCM_XN_CTRL_PRAM0_MASK                  (0x1U)
#define MSCM_XN_CTRL_PRAM0_SHIFT                 (0U)
#define MSCM_XN_CTRL_PRAM0_WIDTH                 (1U)
#define MSCM_XN_CTRL_PRAM0(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_PRAM0_SHIFT)) & MSCM_XN_CTRL_PRAM0_MASK)

#define MSCM_XN_CTRL_PRAM_1_MASK                 (0x2U)
#define MSCM_XN_CTRL_PRAM_1_SHIFT                (1U)
#define MSCM_XN_CTRL_PRAM_1_WIDTH                (1U)
#define MSCM_XN_CTRL_PRAM_1(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_PRAM_1_SHIFT)) & MSCM_XN_CTRL_PRAM_1_MASK)

#define MSCM_XN_CTRL_PRAM_2_MASK                 (0x4U)
#define MSCM_XN_CTRL_PRAM_2_SHIFT                (2U)
#define MSCM_XN_CTRL_PRAM_2_WIDTH                (1U)
#define MSCM_XN_CTRL_PRAM_2(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_PRAM_2_SHIFT)) & MSCM_XN_CTRL_PRAM_2_MASK)

#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_MASK    (0x100U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_SHIFT   (8U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_MASK    (0x200U)
#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_SHIFT   (9U)
#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_1_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_MASK    (0x400U)
#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_SHIFT   (10U)
#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_2_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_3_DIS_ITCM_EXEC_MASK    (0x800U)
#define MSCM_XN_CTRL_CM7_3_DIS_ITCM_EXEC_SHIFT   (11U)
#define MSCM_XN_CTRL_CM7_3_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_3_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_3_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_3_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_0_ITCM_MASK             (0x1000U)
#define MSCM_XN_CTRL_CM7_0_ITCM_SHIFT            (12U)
#define MSCM_XN_CTRL_CM7_0_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_0_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_0_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_1_ITCM_MASK             (0x2000U)
#define MSCM_XN_CTRL_CM7_1_ITCM_SHIFT            (13U)
#define MSCM_XN_CTRL_CM7_1_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_1_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_1_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_2_ITCM_MASK             (0x4000U)
#define MSCM_XN_CTRL_CM7_2_ITCM_SHIFT            (14U)
#define MSCM_XN_CTRL_CM7_2_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_2_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_2_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_2_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_3_ITCM_MASK             (0x8000U)
#define MSCM_XN_CTRL_CM7_3_ITCM_SHIFT            (15U)
#define MSCM_XN_CTRL_CM7_3_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_3_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_3_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_3_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_MASK (0x10000U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_SHIFT (16U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_MASK (0x20000U)
#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_SHIFT (17U)
#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_1_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_MASK (0x40000U)
#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_SHIFT (18U)
#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_2_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_3_DIS_D0_D1TCM_EXEC_MASK (0x80000U)
#define MSCM_XN_CTRL_CM7_3_DIS_D0_D1TCM_EXEC_SHIFT (19U)
#define MSCM_XN_CTRL_CM7_3_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_3_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_3_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_3_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_0_DTCM_MASK             (0x100000U)
#define MSCM_XN_CTRL_CM7_0_DTCM_SHIFT            (20U)
#define MSCM_XN_CTRL_CM7_0_DTCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_0_DTCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DTCM_SHIFT)) & MSCM_XN_CTRL_CM7_0_DTCM_MASK)

#define MSCM_XN_CTRL_CM7_1_DTCM_MASK             (0x200000U)
#define MSCM_XN_CTRL_CM7_1_DTCM_SHIFT            (21U)
#define MSCM_XN_CTRL_CM7_1_DTCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_1_DTCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_1_DTCM_SHIFT)) & MSCM_XN_CTRL_CM7_1_DTCM_MASK)

