rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MSCM.h
#define MSCM_XN_CTRL_CM7_2_DTCM_MASK             (0x400000U)
#define MSCM_XN_CTRL_CM7_2_DTCM_SHIFT            (22U)
#define MSCM_XN_CTRL_CM7_2_DTCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_2_DTCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_2_DTCM_SHIFT)) & MSCM_XN_CTRL_CM7_2_DTCM_MASK)

#define MSCM_XN_CTRL_CM7_3_DTCM_MASK             (0x800000U)
#define MSCM_XN_CTRL_CM7_3_DTCM_SHIFT            (23U)
#define MSCM_XN_CTRL_CM7_3_DTCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_3_DTCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_3_DTCM_SHIFT)) & MSCM_XN_CTRL_CM7_3_DTCM_MASK)

#define MSCM_XN_CTRL_SLK_MASK                    (0x40000000U)
#define MSCM_XN_CTRL_SLK_SHIFT                   (30U)
#define MSCM_XN_CTRL_SLK_WIDTH                   (1U)
#define MSCM_XN_CTRL_SLK(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_SLK_SHIFT)) & MSCM_XN_CTRL_SLK_MASK)

#define MSCM_XN_CTRL_HLK_MASK                    (0x80000000U)
#define MSCM_XN_CTRL_HLK_SHIFT                   (31U)
#define MSCM_XN_CTRL_HLK_WIDTH                   (1U)
#define MSCM_XN_CTRL_HLK(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_HLK_SHIFT)) & MSCM_XN_CTRL_HLK_MASK)
/*! @} */

/*! @name ENEDC - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC_CM7_0_AHBM_MASK               (0x1U)
#define MSCM_ENEDC_CM7_0_AHBM_SHIFT              (0U)
#define MSCM_ENEDC_CM7_0_AHBM_WIDTH              (1U)
#define MSCM_ENEDC_CM7_0_AHBM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_0_AHBM_SHIFT)) & MSCM_ENEDC_CM7_0_AHBM_MASK)

#define MSCM_ENEDC_CM7_0_AHBP_MASK               (0x2U)
#define MSCM_ENEDC_CM7_0_AHBP_SHIFT              (1U)
#define MSCM_ENEDC_CM7_0_AHBP_WIDTH              (1U)
#define MSCM_ENEDC_CM7_0_AHBP(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_0_AHBP_SHIFT)) & MSCM_ENEDC_CM7_0_AHBP_MASK)

#define MSCM_ENEDC_EDMA_MASK                     (0x4U)
#define MSCM_ENEDC_EDMA_SHIFT                    (2U)
#define MSCM_ENEDC_EDMA_WIDTH                    (1U)
#define MSCM_ENEDC_EDMA(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EDMA_SHIFT)) & MSCM_ENEDC_EDMA_MASK)

#define MSCM_ENEDC_HSE_MASK                      (0x10U)
#define MSCM_ENEDC_HSE_SHIFT                     (4U)
#define MSCM_ENEDC_HSE_WIDTH                     (1U)
#define MSCM_ENEDC_HSE(x)                        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_HSE_SHIFT)) & MSCM_ENEDC_HSE_MASK)

#define MSCM_ENEDC_ENET_MASK                     (0x20U)
#define MSCM_ENEDC_ENET_SHIFT                    (5U)
#define MSCM_ENEDC_ENET_WIDTH                    (1U)
#define MSCM_ENEDC_ENET(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ENET_SHIFT)) & MSCM_ENEDC_ENET_MASK)

#define MSCM_ENEDC_CM7_1_AHBM_MASK               (0x40U)
#define MSCM_ENEDC_CM7_1_AHBM_SHIFT              (6U)
#define MSCM_ENEDC_CM7_1_AHBM_WIDTH              (1U)
#define MSCM_ENEDC_CM7_1_AHBM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_1_AHBM_SHIFT)) & MSCM_ENEDC_CM7_1_AHBM_MASK)

#define MSCM_ENEDC_CM7_1_AHBP_MASK               (0x80U)
#define MSCM_ENEDC_CM7_1_AHBP_SHIFT              (7U)
#define MSCM_ENEDC_CM7_1_AHBP_WIDTH              (1U)
#define MSCM_ENEDC_CM7_1_AHBP(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_1_AHBP_SHIFT)) & MSCM_ENEDC_CM7_1_AHBP_MASK)

#define MSCM_ENEDC_ADD_PF0_MASK                  (0x200U)
#define MSCM_ENEDC_ADD_PF0_SHIFT                 (9U)
#define MSCM_ENEDC_ADD_PF0_WIDTH                 (1U)
#define MSCM_ENEDC_ADD_PF0(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_PF0_SHIFT)) & MSCM_ENEDC_ADD_PF0_MASK)

#define MSCM_ENEDC_ADD_PF1_MASK                  (0x400U)
#define MSCM_ENEDC_ADD_PF1_SHIFT                 (10U)
#define MSCM_ENEDC_ADD_PF1_WIDTH                 (1U)
#define MSCM_ENEDC_ADD_PF1(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_PF1_SHIFT)) & MSCM_ENEDC_ADD_PF1_MASK)

#define MSCM_ENEDC_ADD_PF2_MASK                  (0x800U)
#define MSCM_ENEDC_ADD_PF2_SHIFT                 (11U)
#define MSCM_ENEDC_ADD_PF2_WIDTH                 (1U)
#define MSCM_ENEDC_ADD_PF2(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_PF2_SHIFT)) & MSCM_ENEDC_ADD_PF2_MASK)

#define MSCM_ENEDC_PRAM0_MASK                    (0x1000U)
#define MSCM_ENEDC_PRAM0_SHIFT                   (12U)
#define MSCM_ENEDC_PRAM0_WIDTH                   (1U)
#define MSCM_ENEDC_PRAM0(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PRAM0_SHIFT)) & MSCM_ENEDC_PRAM0_MASK)

#define MSCM_ENEDC_ADD_PRAM0_MASK                (0x2000U)
#define MSCM_ENEDC_ADD_PRAM0_SHIFT               (13U)
#define MSCM_ENEDC_ADD_PRAM0_WIDTH               (1U)
#define MSCM_ENEDC_ADD_PRAM0(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_PRAM0_SHIFT)) & MSCM_ENEDC_ADD_PRAM0_MASK)

#define MSCM_ENEDC_PRAM1_MASK                    (0x4000U)
#define MSCM_ENEDC_PRAM1_SHIFT                   (14U)
#define MSCM_ENEDC_PRAM1_WIDTH                   (1U)
#define MSCM_ENEDC_PRAM1(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PRAM1_SHIFT)) & MSCM_ENEDC_PRAM1_MASK)

#define MSCM_ENEDC_ADD_PRAM1_MASK                (0x8000U)
#define MSCM_ENEDC_ADD_PRAM1_SHIFT               (15U)
#define MSCM_ENEDC_ADD_PRAM1_WIDTH               (1U)
#define MSCM_ENEDC_ADD_PRAM1(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_PRAM1_SHIFT)) & MSCM_ENEDC_ADD_PRAM1_MASK)

#define MSCM_ENEDC_QSPI_MASK                     (0x40000U)
#define MSCM_ENEDC_QSPI_SHIFT                    (18U)
#define MSCM_ENEDC_QSPI_WIDTH                    (1U)
#define MSCM_ENEDC_QSPI(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_QSPI_SHIFT)) & MSCM_ENEDC_QSPI_MASK)

#define MSCM_ENEDC_ADD_QSPI_MASK                 (0x80000U)
#define MSCM_ENEDC_ADD_QSPI_SHIFT                (19U)
#define MSCM_ENEDC_ADD_QSPI_WIDTH                (1U)
#define MSCM_ENEDC_ADD_QSPI(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_QSPI_SHIFT)) & MSCM_ENEDC_ADD_QSPI_MASK)

#define MSCM_ENEDC_AIPS0_MASK                    (0x100000U)
#define MSCM_ENEDC_AIPS0_SHIFT                   (20U)
#define MSCM_ENEDC_AIPS0_WIDTH                   (1U)
#define MSCM_ENEDC_AIPS0(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AIPS0_SHIFT)) & MSCM_ENEDC_AIPS0_MASK)

#define MSCM_ENEDC_ADD_AIPS0_MASK                (0x200000U)
#define MSCM_ENEDC_ADD_AIPS0_SHIFT               (21U)
#define MSCM_ENEDC_ADD_AIPS0_WIDTH               (1U)
#define MSCM_ENEDC_ADD_AIPS0(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_AIPS0_SHIFT)) & MSCM_ENEDC_ADD_AIPS0_MASK)

#define MSCM_ENEDC_AIPS1_MASK                    (0x400000U)
#define MSCM_ENEDC_AIPS1_SHIFT                   (22U)
#define MSCM_ENEDC_AIPS1_WIDTH                   (1U)
#define MSCM_ENEDC_AIPS1(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AIPS1_SHIFT)) & MSCM_ENEDC_AIPS1_MASK)

#define MSCM_ENEDC_ADD_AIPS1_MASK                (0x800000U)
#define MSCM_ENEDC_ADD_AIPS1_SHIFT               (23U)
#define MSCM_ENEDC_ADD_AIPS1_WIDTH               (1U)
#define MSCM_ENEDC_ADD_AIPS1(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_AIPS1_SHIFT)) & MSCM_ENEDC_ADD_AIPS1_MASK)

#define MSCM_ENEDC_AIPS2_MASK                    (0x1000000U)
#define MSCM_ENEDC_AIPS2_SHIFT                   (24U)
#define MSCM_ENEDC_AIPS2_WIDTH                   (1U)
#define MSCM_ENEDC_AIPS2(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AIPS2_SHIFT)) & MSCM_ENEDC_AIPS2_MASK)

#define MSCM_ENEDC_ADD_AIPS2_MASK                (0x2000000U)
#define MSCM_ENEDC_ADD_AIPS2_SHIFT               (25U)
#define MSCM_ENEDC_ADD_AIPS2_WIDTH               (1U)
#define MSCM_ENEDC_ADD_AIPS2(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_AIPS2_SHIFT)) & MSCM_ENEDC_ADD_AIPS2_MASK)

#define MSCM_ENEDC_CM7_0_TCM_MASK                (0x4000000U)
#define MSCM_ENEDC_CM7_0_TCM_SHIFT               (26U)
#define MSCM_ENEDC_CM7_0_TCM_WIDTH               (1U)
#define MSCM_ENEDC_CM7_0_TCM(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_0_TCM_SHIFT)) & MSCM_ENEDC_CM7_0_TCM_MASK)

#define MSCM_ENEDC_ADD_CM7_0_TCM_MASK            (0x8000000U)
#define MSCM_ENEDC_ADD_CM7_0_TCM_SHIFT           (27U)
#define MSCM_ENEDC_ADD_CM7_0_TCM_WIDTH           (1U)
#define MSCM_ENEDC_ADD_CM7_0_TCM(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_CM7_0_TCM_SHIFT)) & MSCM_ENEDC_ADD_CM7_0_TCM_MASK)

#define MSCM_ENEDC_CM7_1_TCM_MASK                (0x10000000U)
#define MSCM_ENEDC_CM7_1_TCM_SHIFT               (28U)
#define MSCM_ENEDC_CM7_1_TCM_WIDTH               (1U)
#define MSCM_ENEDC_CM7_1_TCM(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_1_TCM_SHIFT)) & MSCM_ENEDC_CM7_1_TCM_MASK)

