rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MSCM.h
#define MSCM_ENEDC_ADD_CM7_1_TCM_MASK            (0x20000000U)
#define MSCM_ENEDC_ADD_CM7_1_TCM_SHIFT           (29U)
#define MSCM_ENEDC_ADD_CM7_1_TCM_WIDTH           (1U)
#define MSCM_ENEDC_ADD_CM7_1_TCM(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_CM7_1_TCM_SHIFT)) & MSCM_ENEDC_ADD_CM7_1_TCM_MASK)
/*! @} */

/*! @name ENEDC1 - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC1_CM7_2_AHBM_MASK              (0x4U)
#define MSCM_ENEDC1_CM7_2_AHBM_SHIFT             (2U)
#define MSCM_ENEDC1_CM7_2_AHBM_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_2_AHBM(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_AHBM_SHIFT)) & MSCM_ENEDC1_CM7_2_AHBM_MASK)

#define MSCM_ENEDC1_CM7_2_AHBP_MASK              (0x8U)
#define MSCM_ENEDC1_CM7_2_AHBP_SHIFT             (3U)
#define MSCM_ENEDC1_CM7_2_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_2_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_2_AHBP_MASK)

#define MSCM_ENEDC1_PFLASH_3_MASK                (0x10U)
#define MSCM_ENEDC1_PFLASH_3_SHIFT               (4U)
#define MSCM_ENEDC1_PFLASH_3_WIDTH               (1U)
#define MSCM_ENEDC1_PFLASH_3(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_PFLASH_3_SHIFT)) & MSCM_ENEDC1_PFLASH_3_MASK)

#define MSCM_ENEDC1_EDMA_S0_MASK                 (0x20U)
#define MSCM_ENEDC1_EDMA_S0_SHIFT                (5U)
#define MSCM_ENEDC1_EDMA_S0_WIDTH                (1U)
#define MSCM_ENEDC1_EDMA_S0(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA_S0_SHIFT)) & MSCM_ENEDC1_EDMA_S0_MASK)

#define MSCM_ENEDC1_EDMA_S1_MASK                 (0x40U)
#define MSCM_ENEDC1_EDMA_S1_SHIFT                (6U)
#define MSCM_ENEDC1_EDMA_S1_WIDTH                (1U)
#define MSCM_ENEDC1_EDMA_S1(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA_S1_SHIFT)) & MSCM_ENEDC1_EDMA_S1_MASK)

#define MSCM_ENEDC1_MSTR_CHECK_ENET1_MASK        (0x80U)
#define MSCM_ENEDC1_MSTR_CHECK_ENET1_SHIFT       (7U)
#define MSCM_ENEDC1_MSTR_CHECK_ENET1_WIDTH       (1U)
#define MSCM_ENEDC1_MSTR_CHECK_ENET1(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_MSTR_CHECK_ENET1_SHIFT)) & MSCM_ENEDC1_MSTR_CHECK_ENET1_MASK)

#define MSCM_ENEDC1_EN_PRAM2_MASK                (0x400U)
#define MSCM_ENEDC1_EN_PRAM2_SHIFT               (10U)
#define MSCM_ENEDC1_EN_PRAM2_WIDTH               (1U)
#define MSCM_ENEDC1_EN_PRAM2(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EN_PRAM2_SHIFT)) & MSCM_ENEDC1_EN_PRAM2_MASK)

#define MSCM_ENEDC1_ADD_EN_PRAM2_MASK            (0x800U)
#define MSCM_ENEDC1_ADD_EN_PRAM2_SHIFT           (11U)
#define MSCM_ENEDC1_ADD_EN_PRAM2_WIDTH           (1U)
#define MSCM_ENEDC1_ADD_EN_PRAM2(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ADD_EN_PRAM2_SHIFT)) & MSCM_ENEDC1_ADD_EN_PRAM2_MASK)

#define MSCM_ENEDC1_CM7_3_WDATA_CHK_MASK         (0x1000U)
#define MSCM_ENEDC1_CM7_3_WDATA_CHK_SHIFT        (12U)
#define MSCM_ENEDC1_CM7_3_WDATA_CHK_WIDTH        (1U)
#define MSCM_ENEDC1_CM7_3_WDATA_CHK(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_3_WDATA_CHK_SHIFT)) & MSCM_ENEDC1_CM7_3_WDATA_CHK_MASK)

#define MSCM_ENEDC1_CM7_3_ADDR_CHK_MASK          (0x2000U)
#define MSCM_ENEDC1_CM7_3_ADDR_CHK_SHIFT         (13U)
#define MSCM_ENEDC1_CM7_3_ADDR_CHK_WIDTH         (1U)
#define MSCM_ENEDC1_CM7_3_ADDR_CHK(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_3_ADDR_CHK_SHIFT)) & MSCM_ENEDC1_CM7_3_ADDR_CHK_MASK)

#define MSCM_ENEDC1_CM7_2_TCM_MASK               (0x4000U)
#define MSCM_ENEDC1_CM7_2_TCM_SHIFT              (14U)
#define MSCM_ENEDC1_CM7_2_TCM_WIDTH              (1U)
#define MSCM_ENEDC1_CM7_2_TCM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_TCM_SHIFT)) & MSCM_ENEDC1_CM7_2_TCM_MASK)

#define MSCM_ENEDC1_ADD_CM7_2_TCM_MASK           (0x8000U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM_SHIFT          (15U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM_WIDTH          (1U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ADD_CM7_2_TCM_SHIFT)) & MSCM_ENEDC1_ADD_CM7_2_TCM_MASK)

#define MSCM_ENEDC1_CM7_3_AHBM_MASK              (0x20000U)
#define MSCM_ENEDC1_CM7_3_AHBM_SHIFT             (17U)
#define MSCM_ENEDC1_CM7_3_AHBM_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_3_AHBM(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_3_AHBM_SHIFT)) & MSCM_ENEDC1_CM7_3_AHBM_MASK)

#define MSCM_ENEDC1_CM7_3_AHBP_MASK              (0x40000U)
#define MSCM_ENEDC1_CM7_3_AHBP_SHIFT             (18U)
#define MSCM_ENEDC1_CM7_3_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_3_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_3_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_3_AHBP_MASK)

#define MSCM_ENEDC1_MSTR_CHK_ACE_RESULT_CHK_MASK (0x80000U)
#define MSCM_ENEDC1_MSTR_CHK_ACE_RESULT_CHK_SHIFT (19U)
#define MSCM_ENEDC1_MSTR_CHK_ACE_RESULT_CHK_WIDTH (1U)
#define MSCM_ENEDC1_MSTR_CHK_ACE_RESULT_CHK(x)   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_MSTR_CHK_ACE_RESULT_CHK_SHIFT)) & MSCM_ENEDC1_MSTR_CHK_ACE_RESULT_CHK_MASK)

#define MSCM_ENEDC1_MSTR_CHK_ACE_FEED_CHK_MASK   (0x100000U)
#define MSCM_ENEDC1_MSTR_CHK_ACE_FEED_CHK_SHIFT  (20U)
#define MSCM_ENEDC1_MSTR_CHK_ACE_FEED_CHK_WIDTH  (1U)
#define MSCM_ENEDC1_MSTR_CHK_ACE_FEED_CHK(x)     (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_MSTR_CHK_ACE_FEED_CHK_SHIFT)) & MSCM_ENEDC1_MSTR_CHK_ACE_FEED_CHK_MASK)

#define MSCM_ENEDC1_SLV_CHK_ACE_ADDR_CHK_MASK    (0x200000U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ADDR_CHK_SHIFT   (21U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ADDR_CHK_WIDTH   (1U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ADDR_CHK(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_SLV_CHK_ACE_ADDR_CHK_SHIFT)) & MSCM_ENEDC1_SLV_CHK_ACE_ADDR_CHK_MASK)

#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_WDATA_CHK_MASK (0x400000U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_WDATA_CHK_SHIFT (22U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_WDATA_CHK_WIDTH (1U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_WDATA_CHK(x) (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_WDATA_CHK_SHIFT)) & MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_WDATA_CHK_MASK)

#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_ADDR_CHK_MASK (0x800000U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_ADDR_CHK_SHIFT (23U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_ADDR_CHK_WIDTH (1U)
#define MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_ADDR_CHK(x) (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_ADDR_CHK_SHIFT)) & MSCM_ENEDC1_SLV_CHK_ACE_ACCEL_RESULT_M1_GSKT_ADDR_CHK_MASK)

#define MSCM_ENEDC1_TCM_GSKT_ADDR_CHK_MASK       (0x1000000U)
#define MSCM_ENEDC1_TCM_GSKT_ADDR_CHK_SHIFT      (24U)
#define MSCM_ENEDC1_TCM_GSKT_ADDR_CHK_WIDTH      (1U)
#define MSCM_ENEDC1_TCM_GSKT_ADDR_CHK(x)         (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_TCM_GSKT_ADDR_CHK_SHIFT)) & MSCM_ENEDC1_TCM_GSKT_ADDR_CHK_MASK)
/*! @} */

/*! @name IAHBCFGREG - AHB Gasket Configuration */
/*! @{ */

#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_MASK     (0x1U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_SHIFT    (0U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_WIDTH    (1U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT(x)       (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK (0x2U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK (0x4U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT (2U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK)

