rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MSCM.h
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK      (0x8U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT     (3U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_WIDTH     (1U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_MASK      (0x10U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_SHIFT     (4U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_WIDTH     (1U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_MASK     (0x20U)
#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_SHIFT    (5U)
#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_WIDTH    (1U)
#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT(x)       (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_MASK (0x40U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_SHIFT (6U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_MASK (0x80U)
#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_SHIFT (7U)
#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_MASK (0x100U)
#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_SHIFT (8U)
#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_MASK    (0x200U)
#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_SHIFT   (9U)
#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_MASK    (0x400U)
#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_SHIFT   (10U)
#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_MASK    (0x800U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_SHIFT   (11U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_MASK    (0x1000U)
#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_SHIFT   (12U)
#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_GMAC1_DIS_WR_OPT_MASK    (0x2000U)
#define MSCM_IAHBCFGREG_GMAC1_DIS_WR_OPT_SHIFT   (13U)
#define MSCM_IAHBCFGREG_GMAC1_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_GMAC1_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_GMAC1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_GMAC1_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_MASK    (0x4000U)
#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_SHIFT   (14U)
#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_MASK    (0x8000U)
#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_SHIFT   (15U)
#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_0_AHBM_DIS_WR_OPT_MASK (0x10000U)
#define MSCM_IAHBCFGREG_CM7_0_AHBM_DIS_WR_OPT_SHIFT (16U)
#define MSCM_IAHBCFGREG_CM7_0_AHBM_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_0_AHBM_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_0_AHBM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_0_AHBM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_1_AHBM_DIS_WR_OPT_MASK (0x20000U)
#define MSCM_IAHBCFGREG_CM7_1_AHBM_DIS_WR_OPT_SHIFT (17U)
#define MSCM_IAHBCFGREG_CM7_1_AHBM_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_1_AHBM_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_1_AHBM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_1_AHBM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_2_AHBM_DIS_WR_OPT_MASK (0x40000U)
#define MSCM_IAHBCFGREG_CM7_2_AHBM_DIS_WR_OPT_SHIFT (18U)
#define MSCM_IAHBCFGREG_CM7_2_AHBM_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_2_AHBM_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_2_AHBM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_2_AHBM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_3_AHBM_DIS_WR_OPT_MASK (0x80000U)
#define MSCM_IAHBCFGREG_CM7_3_AHBM_DIS_WR_OPT_SHIFT (19U)
#define MSCM_IAHBCFGREG_CM7_3_AHBM_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_3_AHBM_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_3_AHBM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_3_AHBM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_0_AHBP_DIS_WR_OPT_MASK (0x100000U)
#define MSCM_IAHBCFGREG_CM7_0_AHBP_DIS_WR_OPT_SHIFT (20U)
#define MSCM_IAHBCFGREG_CM7_0_AHBP_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_0_AHBP_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_0_AHBP_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_0_AHBP_DIS_WR_OPT_MASK)

