rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MSCM.h
#define MSCM_IAHBCFGREG_CM7_1_AHBP_DIS_WR_OPT_MASK (0x200000U)
#define MSCM_IAHBCFGREG_CM7_1_AHBP_DIS_WR_OPT_SHIFT (21U)
#define MSCM_IAHBCFGREG_CM7_1_AHBP_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_1_AHBP_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_1_AHBP_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_1_AHBP_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_2_AHBP_DIS_WR_OPT_MASK (0x400000U)
#define MSCM_IAHBCFGREG_CM7_2_AHBP_DIS_WR_OPT_SHIFT (22U)
#define MSCM_IAHBCFGREG_CM7_2_AHBP_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_2_AHBP_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_2_AHBP_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_2_AHBP_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_3_AHBP_DIS_WR_OPT_MASK (0x800000U)
#define MSCM_IAHBCFGREG_CM7_3_AHBP_DIS_WR_OPT_SHIFT (23U)
#define MSCM_IAHBCFGREG_CM7_3_AHBP_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_3_AHBP_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_3_AHBP_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_3_AHBP_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_3_AHBS_DIS_WR_OPT_MASK (0x1000000U)
#define MSCM_IAHBCFGREG_CM7_3_AHBS_DIS_WR_OPT_SHIFT (24U)
#define MSCM_IAHBCFGREG_CM7_3_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_3_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_3_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_3_AHBS_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_ACE_ACCEL_RESULT_M1_GSKT_DISABLE_OPT_WR_MASK (0x2000000U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_RESULT_M1_GSKT_DISABLE_OPT_WR_SHIFT (25U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_RESULT_M1_GSKT_DISABLE_OPT_WR_WIDTH (1U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_RESULT_M1_GSKT_DISABLE_OPT_WR(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_ACE_ACCEL_RESULT_M1_GSKT_DISABLE_OPT_WR_SHIFT)) & MSCM_IAHBCFGREG_ACE_ACCEL_RESULT_M1_GSKT_DISABLE_OPT_WR_MASK)

#define MSCM_IAHBCFGREG_ACE_GSKT_DISABLE_OPT_WR_MASK (0x4000000U)
#define MSCM_IAHBCFGREG_ACE_GSKT_DISABLE_OPT_WR_SHIFT (26U)
#define MSCM_IAHBCFGREG_ACE_GSKT_DISABLE_OPT_WR_WIDTH (1U)
#define MSCM_IAHBCFGREG_ACE_GSKT_DISABLE_OPT_WR(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_ACE_GSKT_DISABLE_OPT_WR_SHIFT)) & MSCM_IAHBCFGREG_ACE_GSKT_DISABLE_OPT_WR_MASK)

#define MSCM_IAHBCFGREG_HSE_CMX_GSKT_DAP_DISABLE_OPT_WR_MASK (0x8000000U)
#define MSCM_IAHBCFGREG_HSE_CMX_GSKT_DAP_DISABLE_OPT_WR_SHIFT (27U)
#define MSCM_IAHBCFGREG_HSE_CMX_GSKT_DAP_DISABLE_OPT_WR_WIDTH (1U)
#define MSCM_IAHBCFGREG_HSE_CMX_GSKT_DAP_DISABLE_OPT_WR(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_HSE_CMX_GSKT_DAP_DISABLE_OPT_WR_SHIFT)) & MSCM_IAHBCFGREG_HSE_CMX_GSKT_DAP_DISABLE_OPT_WR_MASK)
/*! @} */

/*! @name IRSPRC - Interrupt Router Shared Peripheral Routing Control */
/*! @{ */

#define MSCM_IRSPRC_M7_0_MASK                    (0x1U)
#define MSCM_IRSPRC_M7_0_SHIFT                   (0U)
#define MSCM_IRSPRC_M7_0_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_0(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_0_SHIFT)) & MSCM_IRSPRC_M7_0_MASK)

#define MSCM_IRSPRC_M7_1_MASK                    (0x2U)
#define MSCM_IRSPRC_M7_1_SHIFT                   (1U)
#define MSCM_IRSPRC_M7_1_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_1(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_1_SHIFT)) & MSCM_IRSPRC_M7_1_MASK)

#define MSCM_IRSPRC_M7_2_MASK                    (0x4U)
#define MSCM_IRSPRC_M7_2_SHIFT                   (2U)
#define MSCM_IRSPRC_M7_2_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_2(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_2_SHIFT)) & MSCM_IRSPRC_M7_2_MASK)

#define MSCM_IRSPRC_M7_3_MASK                    (0x8U)
#define MSCM_IRSPRC_M7_3_SHIFT                   (3U)
#define MSCM_IRSPRC_M7_3_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_3(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_3_SHIFT)) & MSCM_IRSPRC_M7_3_MASK)

#define MSCM_IRSPRC_LOCK_MASK                    (0x8000U)
#define MSCM_IRSPRC_LOCK_SHIFT                   (15U)
#define MSCM_IRSPRC_LOCK_WIDTH                   (1U)
#define MSCM_IRSPRC_LOCK(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_LOCK_SHIFT)) & MSCM_IRSPRC_LOCK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MSCM_Register_Masks */

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K388_MSCM_H_) */
